In [1]:
import pandas as pd

## 一、创建DataFrame
pd.DataFrame(data,index,columns,dtype)

In [3]:
data=[['zhangsang',17,'nan'],['lisi',39,'nv'],['wangwu',45,'nan']]
columns=['name','age','sex']

In [8]:
df=pd.DataFrame(data=data,columns=columns)
df

        name  age  sex
0  zhangsang   17  nan
1       lisi   39   nv
2     wangwu   45  nan

In [10]:
df1=pd.DataFrame(data)
df1

           0   1    2
0  zhangsang  17  nan
1       lisi  39   nv
2     wangwu  45  nan

In [13]:
#字典创建
data_dict={
    'name':['zhangsan','lisi','wangwu'],
    'age':[22,27,33],
    'sex':['nan','nv','nan']
}
df2=pd.DataFrame(data_dict)
df2

       name  age  sex
0  zhangsan   22  nan
1      lisi   27   nv
2    wangwu   33  nan

In [24]:
df2.values

array([['zhangsan', 22, 'nan'],
       ['lisi', 27, 'nv'],
       ['wangwu', 33, 'nan']], dtype=object)

In [26]:
df2.dtypes

name    object
age      int64
sex     object
dtype: object

In [28]:
df2.index

RangeIndex(start=0, stop=3, step=1)

In [30]:
df2.columns

Index(['name', 'age', 'sex'], dtype='object')

In [47]:
pd.set_option('display.unicode.east_asian_width',True) #规整格式
df2.T#转换位置

             0     1       2
name  zhangsan  lisi  wangwu
age         22    27      33
sex        nan    nv     nan

In [48]:
df2.head()

       name  age  sex
0  zhangsan   22  nan
1      lisi   27   nv
2    wangwu   33  nan

In [33]:
df2.tail()

       name  age  sex
0  zhangsan   22  nan
1      lisi   27   nv
2    wangwu   33  nan

In [38]:
df2.shape,df2.shape[0],df2.shape[1]

((3, 3), 3, 3)

In [40]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   sex     3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [42]:
df2.describe()

             age
count   3.000000
mean   27.333333
std     5.507571
min    22.000000
25%    24.500000
50%    27.000000
75%    30.000000
max    33.000000